Autodesk.Revit.DB.Structure.RebarHookType.Create(Autodesk.Revit.DB.Document,System.Double,System.Double)
Creates a new RebarHookType in a document.
angle:
Determine the hook angle in radians of new RebarHookType. Must be greater than 0.0174532925 (1 degree)  and no more than PI (180 degree).
multiplier:
Determine the straight line multiplier of new RebarHookType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not a number
-or-
The given value for multiplier is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
angle must be greater than 0.0174532925 (1 degree)  and no more than PI (180 degree).
-or-
multiplier must be greater than 0 and no more than 99.

Autodesk.Revit.DB.Structure.RebarHookType.HookAngle
The hook angle, measured in radians. Must be greater than 0.0174532925 (1 degree)  and no more than PI (180 degree).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for hookAngle is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: hookAngle must be greater than 0.0174532925 (1 degree)  and no more than PI (180 degree).